In [65]:
import pandas as pd

In [31]:
main_df = pd.read_csv('../data/data_sample.csv')

In [32]:
columns_to_drop = ['case_number', 'domestic', 'beat', 'ward', 'community_area', 'fbi_code', 'x_coord', 'y_coord', 'latitude', 'longitude', 'primary_type', 'description']
main_df.drop(columns=columns_to_drop, inplace=True)

In [33]:
main_df.shape

(3879349, 11)

In [34]:
update_df = pd.read_csv('../data/clean_new_data.csv')

In [35]:
update_df.shape

(50297, 11)

In [36]:
update_df.head()

,id,date,time,block,iucr,location_desc,arrest,district,year,updated_on,location
0,13218359,2023-09-21,00:00:00.000,114XX S UNION AVE,0820,STREET,0,22,2023,2023-09-28T15:42:39.000,POINT(41.686123758 -87.639760794)
1,13220574,2023-09-21,00:00:00.000,070XX N Sheridan Rd,0820,STREET,0,24,2023,2023-09-28T15:42:39.000,POINT(42.010704854 -87.662584365)
2,13222674,2023-09-21,00:00:00.000,007XX N LA SALLE DR,0460,COMMERCIAL / BUSINESS OFFICE,0,18,2023,2023-09-28T15:42:39.000,POINT(41.896013242 -87.632697553)
3,13219537,2023-09-21,00:00:00.000,034XX W CULLOM AVE,0890,RESIDENCE,0,17,2023,2023-09-28T15:42:39.000,POINT(41.959301089 -87.713956891)
4,13217762,2023-09-21,00:00:00.000,0000X S COLUMBUS DR,0920,STREET,0,1,2023,2023-09-28T15:42:39.000,POINT(41.881776822 -87.620767948)

In [66]:
df_combined = pd.concat([main_df, update_df], ignore_index=True)

In [67]:
df_combined.shape

(3929646, 11)

In [68]:
df_combined.head()

,id,date,time,block,iucr,location_desc,arrest,district,year,updated_on,location
0,12729961,2022-06-13,11:24:00,036XX S WELLS ST,0810,SCHOOL - PUBLIC BUILDING,0,9,2022,2023-01-03 15:46:28,POINT(41.828347945 -87.632650679)
1,4674480,2006-04-06,16:49:00,012XX S KARLOV AVE,051A,APARTMENT,0,10,2006,2018-02-28 15:56:25,POINT(41.865419536 -87.727595775)
2,5100489,2006-11-05,04:10:00,037XX N BROADWAY,2900,SIDEWALK,1,19,2006,2018-02-28 15:56:25,POINT(41.950197458 -87.648999894)
3,3216998,2004-02-10,02:00:00,028XX W WILCOX ST,2090,SIDEWALK,1,11,2004,2018-02-10 15:50:01,POINT(41.879245552 -87.697229601)
4,11988664,2020-02-22,07:15:00,075XX W JARVIS AVE,1570,ALLEY,1,16,2020,2020-03-19 15:44:13,POINT(42.015121437 -87.815457954)

In [69]:
df_combined.tail()

,id,date,time,block,iucr,location_desc,arrest,district,year,updated_on,location
3929641,13141484,2023-07-15,08:00:00.000,039XX W FLOURNOY ST,0610,RESIDENCE,0,11,2023,2023-08-19T15:40:26.000,POINT(41.872559142 -87.723786945)
3929642,13141591,2023-07-15,08:00:00.000,067XX S CRANDON AVE,2820,APARTMENT,0,3,2023,2023-08-19T15:40:26.000,POINT(41.772711564 -87.569952861)
3929643,13141246,2023-07-15,08:00:00.000,071XX S PAXTON AVE,0910,STREET,0,3,2023,2023-08-19T15:40:26.000,POINT(41.765281136 -87.57136054)
3929644,13145984,2023-07-15,08:00:00.000,052XX S KEATING AVE,2826,OTHER (SPECIFY),0,8,2023,2023-08-19T15:40:26.000,POINT(41.79791797 -87.741676545)
3929645,13164141,2023-07-15,08:00:00.000,075XX N WASHTENAW AVE,1120,SIDEWALK,0,24,2023,2023-08-19T15:40:26.000,POINT(42.018832815 -87.697238751)

In [78]:
date_df = df_combined[['date']]
date_df = date_df.drop_duplicates().reset_index(drop=True)

In [79]:
date_df.shape

(8299, 1)

In [80]:
date_df.head()

         date
0  2022-06-13
1  2006-04-06
2  2006-11-05
3  2004-02-10
4  2020-02-22

In [83]:
date_df['date'] = pd.to_datetime(date_df['date'])

In [84]:
date_df['date_id'] = date_df['date'].dt.strftime('%Y%m%d')

In [88]:
date_df['year'] = date_df['date'].dt.year

In [91]:
date_df['month'] = date_df['date'].dt.strftime('%B')

In [92]:
date_df['day_week'] = date_df['date'].dt.strftime('%A')

In [60]:
date_df = date_df[['date_id', 'date', 'year', 'month', 'day_week']]

In [61]:
date_df.head()

    date_id       date  year     month  day_week
0  20220613 2022-06-13  2022      June    Monday
1  20060406 2006-04-06  2006     April  Thursday
2  20061105 2006-11-05  2006  November    Sunday
3  20040210 2004-02-10  2004  February   Tuesday
4  20200222 2020-02-22  2020  February  Saturday